raspberrypi/pico-sdk/src/rp2350/hardware_regs/include/hardware/regs/i2c.h
// THIS HEADER FILE IS AUTOMATICALLY GENERATED -- DO NOT EDIT

/**
 * Copyright (c) 2024 Raspberry Pi Ltd.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
// =============================================================================
// Register block : I2C
// Version        : 1
// Bus type       : apb
// Description    : DW_apb_i2c address block
//
//                  List of configuration constants for the Synopsys I2C
//                  hardware (you may see references to these in I2C register
//                  header; these are *fixed* values, set at hardware design
//                  time):
//
//                  IC_ULTRA_FAST_MODE ................ 0x0
//                  IC_UFM_TBUF_CNT_DEFAULT ........... 0x8
//                  IC_UFM_SCL_LOW_COUNT .............. 0x0008
//                  IC_UFM_SCL_HIGH_COUNT ............. 0x0006
//                  IC_TX_TL .......................... 0x0
//                  IC_TX_CMD_BLOCK ................... 0x1
//                  IC_HAS_DMA ........................ 0x1
//                  IC_HAS_ASYNC_FIFO ................. 0x0
//                  IC_SMBUS_ARP ...................... 0x0
//                  IC_FIRST_DATA_BYTE_STATUS ......... 0x1
//                  IC_INTR_IO ........................ 0x1
//                  IC_MASTER_MODE .................... 0x1
//                  IC_DEFAULT_ACK_GENERAL_CALL ....... 0x1
//                  IC_INTR_POL ....................... 0x1
//                  IC_OPTIONAL_SAR ................... 0x0
//                  IC_DEFAULT_TAR_SLAVE_ADDR ......... 0x055
//                  IC_DEFAULT_SLAVE_ADDR ............. 0x055
//                  IC_DEFAULT_HS_SPKLEN .............. 0x1
//                  IC_FS_SCL_HIGH_COUNT .............. 0x0006
//                  IC_HS_SCL_LOW_COUNT ............... 0x0008
//                  IC_DEVICE_ID_VALUE ................ 0x0
//                  IC_10BITADDR_MASTER ............... 0x0
//                  IC_CLK_FREQ_OPTIMIZATION .......... 0x0
//                  IC_DEFAULT_FS_SPKLEN .............. 0x7
//                  IC_ADD_ENCODED_PARAMS ............. 0x0
//                  IC_DEFAULT_SDA_HOLD ............... 0x000001
//                  IC_DEFAULT_SDA_SETUP .............. 0x64
//                  IC_AVOID_RX_FIFO_FLUSH_ON_TX_ABRT . 0x0
//                  IC_CLOCK_PERIOD ................... 100
//                  IC_EMPTYFIFO_HOLD_MASTER_EN ....... 1
//                  IC_RESTART_EN ..................... 0x1
//                  IC_TX_CMD_BLOCK_DEFAULT ........... 0x0
//                  IC_BUS_CLEAR_FEATURE .............. 0x0
//                  IC_CAP_LOADING .................... 100
//                  IC_FS_SCL_LOW_COUNT ............... 0x000d
//                  APB_DATA_WIDTH .................... 32
//                  IC_SDA_STUCK_TIMEOUT_DEFAULT ...... 0xffffffff
//                  IC_SLV_DATA_NACK_ONLY ............. 0x1
//                  IC_10BITADDR_SLAVE ................ 0x0
//                  IC_CLK_TYPE ....................... 0x0
//                  IC_SMBUS_UDID_MSB ................. 0x0
//                  IC_SMBUS_SUSPEND_ALERT ............ 0x0
//                  IC_HS_SCL_HIGH_COUNT .............. 0x0006
//                  IC_SLV_RESTART_DET_EN ............. 0x1
//                  IC_SMBUS .......................... 0x0
//                  IC_OPTIONAL_SAR_DEFAULT ........... 0x0
//                  IC_PERSISTANT_SLV_ADDR_DEFAULT .... 0x0
//                  IC_USE_COUNTS ..................... 0x0
//                  IC_RX_BUFFER_DEPTH ................ 16
//                  IC_SCL_STUCK_TIMEOUT_DEFAULT ...... 0xffffffff
//                  IC_RX_FULL_HLD_BUS_EN ............. 0x1
//                  IC_SLAVE_DISABLE .................. 0x1
//                  IC_RX_TL .......................... 0x0
//                  IC_DEVICE_ID ...................... 0x0
//                  IC_HC_COUNT_VALUES ................ 0x0
//                  I2C_DYNAMIC_TAR_UPDATE ............ 0
//                  IC_SMBUS_CLK_LOW_MEXT_DEFAULT ..... 0xffffffff
//                  IC_SMBUS_CLK_LOW_SEXT_DEFAULT ..... 0xffffffff
//                  IC_HS_MASTER_CODE ................. 0x1
//                  IC_SMBUS_RST_IDLE_CNT_DEFAULT ..... 0xffff
//                  IC_SMBUS_UDID_LSB_DEFAULT ......... 0xffffffff
//                  IC_SS_SCL_HIGH_COUNT .............. 0x0028
//                  IC_SS_SCL_LOW_COUNT ............... 0x002f
//                  IC_MAX_SPEED_MODE ................. 0x2
//                  IC_STAT_FOR_CLK_STRETCH ........... 0x0
//                  IC_STOP_DET_IF_MASTER_ACTIVE ...... 0x0
//                  IC_DEFAULT_UFM_SPKLEN ............. 0x1
//                  IC_TX_BUFFER_DEPTH ................ 16
// =============================================================================
#ifndef _HARDWARE_REGS_I2C_H
#define _HARDWARE_REGS_I2C_H
// =============================================================================
// Register    : I2C_IC_CON
// Description : I2C Control Register. This register can be written only when
//               the DW_apb_i2c is disabled, which corresponds to the
//               IC_ENABLE[0] register being set to 0. Writes at other times
//               have no effect.
//
//               Read/Write Access: - bit 10 is read only. - bit 11 is read only
//               - bit 16 is read only - bit 17 is read only - bits 18 and 19
//               are read only.
#define I2C_IC_CON_OFFSET _u(0x00000000)
#define I2C_IC_CON_BITS   _u(0x000007ff)
#define I2C_IC_CON_RESET  _u(0x00000065)
// -----------------------------------------------------------------------------
// Field       : I2C_IC_CON_STOP_DET_IF_MASTER_ACTIVE
// Description : Master issues the STOP_DET interrupt irrespective of whether
//               master is active or not
#define I2C_IC_CON_STOP_DET_IF_MASTER_ACTIVE_RESET  _u(0x0)
#define I2C_IC_CON_STOP_DET_IF_MASTER_ACTIVE_BITS   _u(0x00000400)
#define I2C_IC_CON_STOP_DET_IF_MASTER_ACTIVE_MSB    _u(10)
#define I2C_IC_CON_STOP_DET_IF_MASTER_ACTIVE_LSB    _u(10)
#define I2C_IC_CON_STOP_DET_IF_MASTER_ACTIVE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : I2C_IC_CON_RX_FIFO_FULL_HLD_CTRL
// Description : This bit controls whether DW_apb_i2c should hold the bus when
//               the Rx FIFO is physically full to its RX_BUFFER_DEPTH, as
//               described in the IC_RX_FULL_HLD_BUS_EN parameter.
//
//               Reset value: 0x0.
//               0x0 -> Overflow when RX_FIFO is full
//               0x1 -> Hold bus when RX_FIFO is full
#define I2C_IC_CON_RX_FIFO_FULL_HLD_CTRL_RESET  _u(0x0)
#define I2C_IC_CON_RX_FIFO_FULL_HLD_CTRL_BITS   _u(0x00000200)
#define I2C_IC_CON_RX_FIFO_FULL_HLD_CTRL_MSB    _u(9)
#define I2C_IC_CON_RX_FIFO_FULL_HLD_CTRL_LSB    _u(9)
#define I2C_IC_CON_RX_FIFO_FULL_HLD_CTRL_ACCESS "RW"
#define I2C_IC_CON_RX_FIFO_FULL_HLD_CTRL_VALUE_DISABLED _u(0x0)
#define I2C_IC_CON_RX_FIFO_FULL_HLD_CTRL_VALUE_ENABLED _u(0x1)
// -----------------------------------------------------------------------------
// Field       : I2C_IC_CON_TX_EMPTY_CTRL
// Description : This bit controls the generation of the TX_EMPTY interrupt, as
//               described in the IC_RAW_INTR_STAT register.
//
//               Reset value: 0x0.
//               0x0 -> Default behaviour of TX_EMPTY interrupt
//               0x1 -> Controlled generation of TX_EMPTY interrupt
#define I2C_IC_CON_TX_EMPTY_CTRL_RESET  _u(0x0)
#define I2C_IC_CON_TX_EMPTY_CTRL_BITS   _u(0x00000100)
#define I2C_IC_CON_TX_EMPTY_CTRL_MSB    _u(8)
#define I2C_IC_CON_TX_EMPTY_CTRL_LSB    _u(8)
#define I2C_IC_CON_TX_EMPTY_CTRL_ACCESS "RW"
#define I2C_IC_CON_TX_EMPTY_CTRL_VALUE_DISABLED _u(0x0)
#define I2C_IC_CON_TX_EMPTY_CTRL_VALUE_ENABLED _u(0x1)
// -----------------------------------------------------------------------------
// Field       : I2C_IC_CON_STOP_DET_IFADDRESSED
// Description : In slave mode: - 1'b1:  issues the STOP_DET interrupt only when
//               it is addressed. - 1'b0:  issues the STOP_DET irrespective of
//               whether it's addressed or not. Reset value: 0x0
//
//               NOTE: During a general call address, this slave does not issue
//               the STOP_DET interrupt if STOP_DET_IF_ADDRESSED = 1'b1, even if
//               the slave responds to the general call address by generating
//               ACK. The STOP_DET interrupt is generated only when the
//               transmitted address matches the slave address (SAR).
//               0x0 -> slave issues STOP_DET intr always
//               0x1 -> slave issues STOP_DET intr only if addressed
#define I2C_IC_CON_STOP_DET_IFADDRESSED_RESET  _u(0x0)
#define I2C_IC_CON_STOP_DET_IFADDRESSED_BITS   _u(0x00000080)
#define I2C_IC_CON_STOP_DET_IFADDRESSED_MSB    _u(7)
#define I2C_IC_CON_STOP_DET_IFADDRESSED_LSB    _u(7)
#define I2C_IC_CON_STOP_DET_IFADDRESSED_ACCESS "RW"
#define I2C_IC_CON_STOP_DET_IFADDRESSED_VALUE_DISABLED _u(0x0)
#define I2C_IC_CON_STOP_DET_IFADDRESSED_VALUE_ENABLED _u(0x1)
// -----------------------------------------------------------------------------
// Field       : I2C_IC_CON_IC_SLAVE_DISABLE
// Description : This bit controls whether I2C has its slave disabled, which
//               means once the presetn signal is applied, then this bit is set
//               and the slave is disabled.
//
//               If this bit is set (slave is disabled), DW_apb_i2c functions
//               only as a master and does not perform any action that requires
//               a slave.
//
//               NOTE: Software should ensure that if this bit is written with
//               0, then bit 0 should also be written with a 0.
//               0x0 -> Slave mode is enabled
//               0x1 -> Slave mode is disabled
#define I2C_IC_CON_IC_SLAVE_DISABLE_RESET  _u(0x1)
#define I2C_IC_CON_IC_SLAVE_DISABLE_BITS   _u(0x00000040)
#define I2C_IC_CON_IC_SLAVE_DISABLE_MSB    _u(6)
#define I2C_IC_CON_IC_SLAVE_DISABLE_LSB    _u(6)
#define I2C_IC_CON_IC_SLAVE_DISABLE_ACCESS "RW"
#define I2C_IC_CON_IC_SLAVE_DISABLE_VALUE_SLAVE_ENABLED _u(0x0)
#define I2C_IC_CON_IC_SLAVE_DISABLE_VALUE_SLAVE_DISABLED _u(0x1)
// -----------------------------------------------------------------------------
// Field       : I2C_IC_CON_IC_RESTART_EN
// Description : Determines whether RESTART conditions may be sent when acting
//               as a master. Some older slaves do not support handling RESTART
//               conditions; however, RESTART conditions are used in several
//               DW_apb_i2c operations. When RESTART is disabled, the master is
//               prohibited from performing the following functions: - Sending a
//               START BYTE - Performing any high-speed mode operation - High-
//               speed mode operation - Performing direction changes in combined
//               format mode - Performing a read operation with a 10-bit address
//               By replacing RESTART condition followed by a STOP and a
//               subsequent START condition, split operations are broken down
//               into multiple DW_apb_i2c transfers. If the above operations are
//               performed, it will result in setting bit 6 (TX_ABRT) of the
//               IC_RAW_INTR_STAT register.
//
//               Reset value: ENABLED
//               0x0 -> Master restart disabled
//               0x1 -> Master restart enabled
#define I2C_IC_CON_IC_RESTART_EN_RESET  _u(0x1)
#define I2C_IC_CON_IC_RESTART_EN_BITS   _u(0x00000020)
#define I2C_IC_CON_IC_RESTART_EN_MSB    _u(5)
#define I2C_IC_CON_IC_RESTART_EN_LSB    _u(5)
#define I2C_IC_CON_IC_RESTART_EN_ACCESS "RW"
#define I2C_IC_CON_IC_RESTART_EN_VALUE_DISABLED _u(0x0)
#define I2C_IC_CON_IC_RESTART_EN_VALUE_ENABLED _u(0x1)
// -----------------------------------------------------------------------------
// Field       : I2C_IC_CON_IC_10BITADDR_MASTER
// Description : Controls whether the DW_apb_i2c starts its transfers in 7- or
//               10-bit addressing mode when acting as a master. - 0: 7-bit
//               addressing - 1: 10-bit addressing
//               0x0 -> Master 7Bit addressing mode
//               0x1 -> Master 10Bit addressing mode
#define I2C_IC_CON_IC_10BITADDR_MASTER_RESET  _u(0x0)
#define I2C_IC_CON_IC_10BITADDR_MASTER_BITS   _u(0x00000010)
#define I2C_IC_CON_IC_10BITADDR_MASTER_MSB    _u(4)
#define I2C_IC_CON_IC_10BITADDR_MASTER_LSB    _u(4)
#define I2C_IC_CON_IC_10BITADDR_MASTER_ACCESS "RW"
#define I2C_IC_CON_IC_10BITADDR_MASTER_VALUE_ADDR_7BITS _u(0x0)
#define I2C_IC_CON_IC_10BITADDR_MASTER_VALUE_ADDR_10BITS _u(0x1)
// -----------------------------------------------------------------------------
// Field       : I2C_IC_CON_IC_10BITADDR_SLAVE
// Description : When acting as a slave, this bit controls whether the
//               DW_apb_i2c responds to 7- or 10-bit addresses. - 0: 7-bit
//               addressing. The DW_apb_i2c ignores transactions that involve
//               10-bit addressing; for 7-bit addressing, only the lower 7 bits
//               of the IC_SAR register are compared. - 1: 10-bit addressing.
//               The DW_apb_i2c responds to only 10-bit addressing transfers
//               that match the full 10 bits of the IC_SAR register.
//               0x0 -> Slave 7Bit addressing
//               0x1 -> Slave 10Bit addressing
#define I2C_IC_CON_IC_10BITADDR_SLAVE_RESET  _u(0x0)
#define I2C_IC_CON_IC_10BITADDR_SLAVE_BITS   _u(0x00000008)
#define I2C_IC_CON_IC_10BITADDR_SLAVE_MSB    _u(3)
#define I2C_IC_CON_IC_10BITADDR_SLAVE_LSB    _u(3)
#define I2C_IC_CON_IC_10BITADDR_SLAVE_ACCESS "RW"
#define I2C_IC_CON_IC_10BITADDR_SLAVE_VALUE_ADDR_7BITS _u(0x0)
#define I2C_IC_CON_IC_10BITADDR_SLAVE_VALUE_ADDR_10BITS _u(0x1)
// -----------------------------------------------------------------------------
// Field       : I2C_IC_CON_SPEED
// Description : These bits control at which speed the DW_apb_i2c operates; its
//               setting is relevant only if one is operating the DW_apb_i2c in
//               master mode. Hardware protects against illegal values being
//               programmed by software. These bits must be programmed
//               appropriately for slave mode also, as it is used to capture
//               correct value of spike filter as per the speed mode.
//
//               This register should be programmed only with a value in the
//               range of 1 to IC_MAX_SPEED_MODE; otherwise, hardware updates
//               this register with the value of IC_MAX_SPEED_MODE.
//
//               1: standard mode (100 kbit/s)
//
//               2: fast mode (<=400 kbit/s) or fast mode plus (<=1000Kbit/s)
//
//               3: high speed mode (3.4 Mbit/s)
//
//               Note: This field is not applicable when IC_ULTRA_FAST_MODE=1
//               0x1 -> Standard Speed mode of operation
//               0x2 -> Fast or Fast Plus mode of operation
//               0x3 -> High Speed mode of operation
#define I2C_IC_CON_SPEED_RESET  _u(0x2)
#define I2C_IC_CON_SPEED_BITS   _u(0x00000006)
#define I2C_IC_CON_SPEED_MSB    _u(2)
#define I2C_IC_CON_SPEED_LSB    _u(1)
#define I2C_IC_CON_SPEED_ACCESS "RW"
#define I2C_IC_CON_SPEED_VALUE_STANDARD _u(0x1)
#define I2C_IC_CON_SPEED_VALUE_FAST _u(0x2)
#define I2C_IC_CON_SPEED_VALUE_HIGH _u(0x3)
// -----------------------------------------------------------------------------
// Field       : I2C_IC_CON_MASTER_MODE
// Description : This bit controls whether the DW_apb_i2c master is enabled.
//
//               NOTE: Software should ensure that if this bit is written with
//               '1' then bit 6 should also be written with a '1'.
//               0x0 -> Master mode is disabled
//               0x1 -> Master mode is enabled
#define I2C_IC_CON_MASTER_MODE_RESET  _u(0x1)
#define I2C_IC_CON_MASTER_MODE_BITS   _u(0x00000001)
#define I2C_IC_CON_MASTER_MODE_MSB    _u(0)
#define I2C_IC_CON_MASTER_MODE_LSB    _u(0)
#define I2C_IC_CON_MASTER_MODE_ACCESS "RW"
#define I2C_IC_CON_MASTER_MODE_VALUE_DISABLED _u(0x0)
#define I2C_IC_CON_MASTER_MODE_VALUE_ENABLED _u(0x1)
// =============================================================================
// Register    : I2C_IC_TAR
// Description : I2C Target Address Register
//
//               This register is 12 bits wide, and bits 31:12 are reserved.
//               This register can be written to only when IC_ENABLE[0] is set
//               to 0.
//
//               Note: If the software or application is aware that the
//               DW_apb_i2c is not using the TAR address for the pending
//               commands in the Tx FIFO, then it is possible to update the TAR
//               address even while the Tx FIFO has entries (IC_STATUS[2]= 0). -
//               It is not necessary to perform any write to this register if
//               DW_apb_i2c is enabled as an I2C slave only.
#define I2C_IC_TAR_OFFSET _u(0x00000004)
#define I2C_IC_TAR_BITS   _u(0x00000fff)
#define I2C_IC_TAR_RESET  _u(0x00000055)
// -----------------------------------------------------------------------------
// Field       : I2C_IC_TAR_SPECIAL
// Description : This bit indicates whether software performs a Device-ID or
//               General Call or START BYTE command. - 0: ignore bit 10
//               GC_OR_START and use IC_TAR normally - 1: perform special I2C
//               command as specified in Device_ID or GC_OR_START bit Reset
//               value: 0x0
//               0x0 -> Disables programming of GENERAL_CALL or START_BYTE transmission
//               0x1 -> Enables programming of GENERAL_CALL or START_BYTE transmission
#define I2C_IC_TAR_SPECIAL_RESET  _u(0x0)
#define I2C_IC_TAR_SPECIAL_BITS   _u(0x00000800)
#define I2C_IC_TAR_SPECIAL_MSB    _u(11)
#define I2C_IC_TAR_SPECIAL_LSB    _u(11)
#define I2C_IC_TAR_SPECIAL_ACCESS "RW"
#define I2C_IC_TAR_SPECIAL_VALUE_DISABLED _u(0x0)
#define I2C_IC_TAR_SPECIAL_VALUE_ENABLED _u(0x1)
// -----------------------------------------------------------------------------
// Field       : I2C_IC_TAR_GC_OR_START
// Description : If bit 11 (SPECIAL) is set to 1 and bit 13(Device-ID) is set to
//               0, then this bit indicates whether a General Call or START byte
//               command is to be performed by the DW_apb_i2c. - 0: General Call
//               Address - after issuing a General Call, only writes may be
//               performed. Attempting to issue a read command results in
//               setting bit 6 (TX_ABRT) of the IC_RAW_INTR_STAT register. The
//               DW_apb_i2c remains in General Call mode until the SPECIAL bit
//               value (bit 11) is cleared. - 1: START BYTE Reset value: 0x0
//               0x0 -> GENERAL_CALL byte transmission
//               0x1 -> START byte transmission
#define I2C_IC_TAR_GC_OR_START_RESET  _u(0x0)
#define I2C_IC_TAR_GC_OR_START_BITS   _u(0x00000400)
#define I2C_IC_TAR_GC_OR_START_MSB    _u(10)
#define I2C_IC_TAR_GC_OR_START_LSB    _u(10)
#define I2C_IC_TAR_GC_OR_START_ACCESS "RW"
#define I2C_IC_TAR_GC_OR_START_VALUE_GENERAL_CALL _u(0x0)
#define I2C_IC_TAR_GC_OR_START_VALUE_START_BYTE _u(0x1)
// -----------------------------------------------------------------------------
// Field       : I2C_IC_TAR_IC_TAR
// Description : This is the target address for any master transaction. When
//               transmitting a General Call, these bits are ignored. To
//               generate a START BYTE, the CPU needs to write only once into
//               these bits.
//
//               If the IC_TAR and IC_SAR are the same, loopback exists but the
//               FIFOs are shared between master and slave, so full loopback is
//               not feasible. Only one direction loopback mode is supported
//               (simplex), not duplex. A master cannot transmit to itself; it
//               can transmit to only a slave.
#define I2C_IC_TAR_IC_TAR_RESET  _u(0x055)
#define I2C_IC_TAR_IC_TAR_BITS   _u(0x000003ff)
#define I2C_IC_TAR_IC_TAR_MSB    _u(9)
#define I2C_IC_TAR_IC_TAR_LSB    _u(0)
#define I2C_IC_TAR_IC_TAR_ACCESS "RW"
// =============================================================================
// Register    : I2C_IC_SAR
// Description : I2C Slave Address Register
#define I2C_IC_SAR_OFFSET _u(0x00000008)
#define I2C_IC_SAR_BITS   _u(0x000003ff)
#define I2C_IC_SAR_RESET  _u(0x00000055)
// -----------------------------------------------------------------------------
// Field       : I2C_IC_SAR_IC_SAR
// Description : The IC_SAR holds the slave address when the I2C is operating as
//               a slave. For 7-bit addressing, only IC_SAR[6:0] is used.
//
//               This register can be written only when the I2C interface is
//               disabled, which corresponds to the IC_ENABLE[0] register being
//               set to 0. Writes at other times have no effect.
//
//               Note: The default values cannot be any of the reserved address
//               locations: that is, 0x00 to 0x07, or 0x78 to 0x7f. The correct
//               operation of the device is not guaranteed if you program the
//               IC_SAR or IC_TAR to a reserved value. Refer to
//               <<table_I2C_firstbyte_bit_defs>> for a complete list of these
//               reserved values.
#define I2C_IC_SAR_IC_SAR_RESET  _u(0x055)
#define I2C_IC_SAR_IC_SAR_BITS   _u(0x000003ff)
#define I2C_IC_SAR_IC_SAR_MSB    _u(9)
#define I2C_IC_SAR_IC_SAR_LSB    _u(0)
#define I2C_IC_SAR_IC_SAR_ACCESS "RW"
// =============================================================================
// Register    : I2C_IC_DATA_CMD
// Description : I2C Rx/Tx Data Buffer and Command Register; this is the
//               register the CPU writes to when filling the TX FIFO and the CPU
//               reads from when retrieving bytes from RX FIFO.
//
//               The size of the register changes as follows:
//
//               Write: - 11 bits when IC_EMPTYFIFO_HOLD_MASTER_EN=1 - 9 bits
//               when IC_EMPTYFIFO_HOLD_MASTER_EN=0 Read: - 12 bits when
//               IC_FIRST_DATA_BYTE_STATUS = 1 - 8 bits when
//               IC_FIRST_DATA_BYTE_STATUS = 0 Note: In order for the DW_apb_i2c
//               to continue acknowledging reads, a read command should be
//               written for every byte that is to be received; otherwise the
//               DW_apb_i2c will stop acknowledging.
#define I2C_IC_DATA_CMD_OFFSET _u(0x00000010)
#define I2C_IC_DATA_CMD_BITS   _u(0x00000fff)
#define I2C_IC_DATA_CMD_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : I2C_IC_DATA_CMD_FIRST_DATA_BYTE
// Description : Indicates the first data byte received after the address phase
//               for receive transfer in Master receiver or Slave receiver mode.
//
//               Reset value : 0x0
//
//               NOTE:  In case of APB_DATA_WIDTH=8,
//
//               1. The user has to perform two APB Reads to IC_DATA_CMD in
//               order to get status on 11 bit.
//
//               2. In order to read the 11 bit, the user has to perform the
//               first data byte read [7:0] (offset 0x10) and then perform the
//               second read [15:8] (offset 0x11) in order to know the status of
//               11 bit (whether the data received in previous read is a first
//               data byte or not).
//
//               3. The 11th bit is an optional read field, user can ignore 2nd
//               byte read [15:8] (offset 0x11) if not interested in
//               FIRST_DATA_BYTE status.
//               0x0 -> Sequential data byte received
//               0x1 -> Non sequential data byte received
#define I2C_IC_DATA_CMD_FIRST_DATA_BYTE_RESET  _u(0x0)
#define I2C_IC_DATA_CMD_FIRST_DATA_BYTE_BITS   _u(0x00000800)
#define I2C_IC_DATA_CMD_FIRST_DATA_BYTE_MSB    _u(11)
#define I2C_IC_DATA_CMD_FIRST_DATA_BYTE_LSB    _u(11)
